app/controllers/products_controller.rb

  def index
    @products = Product.where(published: true)
---
SELECT `products`.* FROM `products` WHERE `products`.`published` = TRUE

  def show
    @item = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 9 LIMIT 1

  def new

    @product = Product.new
    @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def create
    product_params = params.require(:product).permit(
      :title,
      :description,
      :price,
      :published,
      :category_id
    )

    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO `products` (`title`, `description`, `created_at`, `updated_at`, `price`, `published`, `category_id`) VALUES ('php book', 'PHP Book for beginner', '2023-12-25 07:30:31.781453', '2023-12-25 07:30:31.781453', 3.0, TRUE, 1)